Repository: DenysMb/Kontainer
Catalog: po/*/kontainer.po
Languages: de, he, nl, pl

source: container;podman;distrobox;
he: container;podman;distrobox;קונטיינר;מכולה;דיסטרובוקס;
pl: container;podman;distrobox;kontener;

source: Manage Distrobox containers
de: Distrobox-Container verwalten
he: ניהול מכולות של Distrobox
nl: Beheer Distrobox-containers
pl: Zarządzaj kontenerami Distrobox

# NAME OF TRANSLATORS
source: Your names
de: renner0e
he: צוות התרגום של KDE ישראל
nl: Heimen Stoffels
pl: Marcel Mrówka

# EMAIL OF TRANSLATORS
source: Your emails
de: Renner03@protonmail.com
he: kde-l10n-he@kde.org
nl: vistausss@fastmail.com
pl: micro.mail88@gmail.com

source: Press any key to close this terminal…
de: Drücken Sie eine beliebige Taste, um dieses Terminal zu schließen …
he: לחיצה על מקש כלשהו תסגור את המסוף…
nl: Druk op een toets om dit terminalvenster te sluiten…
pl: Naciśnij dowolny klawisz, aby zamknąć ten terminal...

source: Cannot automatically install packages for this distribution. Please enter the distrobox manually and install it using the appropriate package manager.
he: לא ניתן להתקין חבילות אוטומטית בהפצה הזאת. נא להיכנס ל־distrobox ידנית ולהתקין אותה באמצעות מנהל החבילות המתאים.
nl: Op deze distributie kunnen pakketten niet automatisch worden geïnstalleerd. Voer de distrobox in en installeer deze met behulp van de pakketbeheerder.
pl: Nie można automatycznie zainstalować pakietów dla tej dystrybucji. Proszę wejść do distroboxa i ręcznie zainstalować je używając odpowiedniego menedżera pakietów.

source: Denys Madureira (c) 2025
he: דניס מדוריירה (c) 2025

# @info:credit
source: Denys Madureira
he: דניס מדוריירה

# @info:credit
source: Author
de: Autor
he: יוצר
nl: Maker
pl: Autor

source: Applications Management - %1
he: ניהול יישומים - %1
nl: Programmabeheer - %1
pl: Zarządzanie aplikacjami - %1

source: Refresh
de: Aktualisieren
he: ריענון
nl: Herladen
pl: Odśwież

source: Exported Applications (%1)
he: יישומים שיוצאו (%1)
nl: Geëxporteerde programma's (%1)
pl: Wyeksportowane aplikacje (%1)

source: All Applications (%1)
he: כל היישומים (%1)
nl: Alle programma's (%1)
pl: Wszystkie aplikacje (%1)

source: Search exported applications...
he: חיפוש ביישומים שיוצאו…
nl: Geëxporteerde programma's doorzoeken…
pl: Wyszukuj wyeksportowanych aplikacji...

source: Search available applications...
he: חיפוש ביישומים הזמינים…
nl: Beschikbare programma's doorzoeken…
pl: Wyszukuj dostępnych aplikacji...

source: No exported applications found matching '%1'
he: לא נמצאו יישומים שיוצאו שעונים על החיפוש ‚%1’
nl: Er zijn geen programma's die overeenkomen met ‘%1’
pl: Brak wyeksportowanych aplikacji pasujących do '%1'

source: No exported applications found
he: לא נמצאו יישומים שיוצאו
nl: Er zijn geen programma's beschikbaar
pl: Nie znaleziono wyeksportowanych aplikacji

source: No applications found matching '%1'
he: לא נמצאו יישומים שעונים על החיפוש ‚%1’
nl: Er zijn geen programma's die overeenkomen met ‘%1’
pl: Brak aplikacji pasujących do '%1'

source: No applications found in container
he: לא נמצאו יישומים במכולה
nl: Er zijn geen programma's aangetroffen in de container
pl: Nie znaleziono żadnych aplikacji w kontenerze

source: This container might not have desktop applications installed or they might not be detectable.
he: יכול להיות שלא מותקנים יישומי שולחן עבודה במכולה או שלא ניתן לזהות אותם.
nl: Deze container bevat mogelijk geen programma's of ze zijn niet detecteerbaar.
pl: Ten kontener może nie mieć zainstalowanych aplikacji z graficznym interfejsem lub nie są one wykrywalne.

source: Unexport
he: ביטול ייצוא
nl: Exporteren opheffen
pl: Cofnij eksportowanie

source: Failed to unexport application
he: ביטול ייצוא יישום נכשל
nl: Het programma kan niet worden teruggezet
pl: Cofnięcie eksportowania aplikacji nie powiodło się

source: Export
he: ייצוא
nl: Exporteren
pl: Wyeksportuj

source: Failed to export application
he: ייצוא יישום נכשל
nl: Het programma kan niet worden geëxporteerd
pl: Eksportowanie aplikacji nie powiodło się

source: %1 selected
he: %1 נבחרו
nl: %1 gekozen
pl: %1 zaznaczone

source: Unexport Selected
he: ביטול ייצוא הנבחר
nl: Selectie terugzetten
pl: Cofnij eksportowanie zaznaczonych

source: Export Selected
he: ייצוא הנבחר
nl: Selectie exporteren
pl: Wyeksportuj zaznaczone

source: %1 applications
he: %1 יישומים
nl: %1 programma's
pl: %1 aplikacji

source: Clear Selection
he: איפוס הבחירה
nl: Selectie wissen
pl: Wyczyść zaznaczenie

source: Stop Container
he: עצירת המכולה
nl: Container stoppen
pl: Zatrzymaj kontener

source: Start Container
he: הפעלת המכולה
nl: Container starten
pl: Uruchom kontener

source: Manage Applications
he: ניהול יישומים
nl: Programma's beheren
pl: Zarządzaj aplikacjami

source: Open Terminal
de: Terminal öffnen
he: פתיחת מסוף
nl: Terminalvenster openen
pl: Otwórz terminal

source: More options
he: אפשרויות נוספות
nl: Meer opties
pl: Więcej opcji

source: Install Package
de: Paket installieren
he: התקנת חבילה
nl: Pakket installeren
pl: Zainstaluj pakiet

source: Reboot Container
he: הפעלת מכולה מחדש
nl: Container herstarten
pl: Zrestartuj kontener

source: Upgrade Container
de: Container aktualisieren
he: שדרוג מכולה
nl: Container bijwerken
pl: Zaktualizuj kontener

source: Clone Container
he: שכפול מכולה
nl: Container klonen
pl: Duplikuj kontener

source: Remove Container
de: Container entfernen
he: הסרת מכולה
nl: Container verwijderen
pl: Usuń kontener

source: Container engine not found
he: מנוע המכולות לא נמצא
nl: De containeraandrijving is niet aangetroffen
pl: Nie znaleziono silnika kontenerów

source: Podman or Docker is required to use Kontainer. Please install one of them and click 'Refresh' (or restart the application).
he: כדי להשתמש ב־Kontainer צריך את Podman או את Docker. נא להתקין אחד מהם וללחוץ על ‚ריענון’ או להפעיל את היישום מחדש).
nl: Voor het gebruik van Kontainer is Podman of Docker vereist. Installeer een van de twee en klik op herladen of herstart het programma.
pl: Podman lub Docker jest wymagany, aby korzystać z Kontainera. Proszę zainstalować jednego z nich i nacisnąć "Odśwież" (lub zrestartować aplikację)

source: No containers found. Create a new container now?
de: Keine Container gefunden. Jetzt einen neuen Container erstellen?
he: לא נמצאו מכולות. ליצור מכולה חדשה עכשיו?
nl: Er zijn geen containers beschikbaar. Wil je er een maken?
pl: Nie znaleziono kontenerów. Czy chcesz teraz jakiś stworzyć?

source: Create Container
de: Container erstellen
he: ליצור מכולה
nl: Container maken
pl: Stwórz kontener

source: Distrobox Containers
de: Distrobox-Container
he: מכולות Distrobox
pl: Kontenery Distrobox

source: Create…
de: Erstellen …
he: יצירה…
nl: Maken…
pl: Stwórz...

source: Upgrade all…
he: לשדרג הכול…
nl: Alles bijwerken…
pl: Zaktualizuj wszystkie...

source: Create Container…
de: Container erstellen …
he: יצירת מכולה…
nl: Container maken…
pl: Stwórz kontener...

source: Create Distrobox Shortcut…
de: Distrobox-Verknüpfung erstellen
he: יצירת קיצור דרך ל־Distrobox…
nl: Distrobox-snelkoppeling maken…
pl: Stwórz skrót Dixtroboxa...

source: Show Container Icons
he: הצגת סמלי מכולות
nl: Containerpictogrammen tonen
pl: Pokaż ikony kontenerów

source: Clone Container…
he: שכפול מכולה…
nl: Container klonen…
pl: Duplikuj kontener...

source: Open Distrobox Documentation
de: Distrobox-Dokumentation öffnen
he: פתיחת התיעוד של Distrobox
nl: Distrobox-documentatie openen
pl: Otwórz dokumentację Distroboxa

source: Open Distrobox Useful Tips
de: Nützliche Distrobox-Tipps öffnen
he: פתיחת העצות השימושיות של Distrobox
nl: Nuttige Distrobox-tips
pl: Otwórz pomocne porady Distroboxa

source: About Kontainer
de: Über Kontainer
he: על Kontainer
nl: Over Kontainer
pl: O aplikacji Kontainer

source: Clone container
he: שכפול מכולה
nl: Container klonen
pl: Duplikuj kontener

source: No containers available to clone.
he: אין מכולות זמינות לשכפול.
nl: Er zijn geen containers om te klonen.
pl: Brak kontenerów do duplikowania.

source: Select a container to clone.
he: בחירת מכולה לשכפול.
nl: Kies een te klonen container.
pl: Wybierz kontener do zduplikowania.

source: Choose a name for the cloned container.
he: נא לבחור שם למכולה המשוכפלת.
nl: Geef de kloon een naam.
pl: Wybierz nazwę dla zduplikowanego kontenera.

source: Failed to launch clone command. Check your setup and try again.
he: הפעלת פקודת clone (שכפול) נכשלה. נא לבדוק שההתקנה שלך תקינה ולנסות שוב.
nl: De kloonopdracht kan niet worden uitgevoerd. Controleer de instellingen en probeer het opnieuw.
pl: Uruchomienie komendy duplikowania nie powiodło się. Sprawdź swoją konfigurację i spróbuj ponownie.

source: Container
he: מכולה
pl: Kontener

source: Name
he: שם
nl: Naam
pl: Nazwa

source: fedora-clone
he: פדורה-שכפול
pl: fedora-duplikat

source: Select image
he: בחירת דמות
nl: Kies een schijfkopie
pl: Wybierz obraz

source: Create new container
de: Neuen Container erstellen
he: יצירת מכולה חדשה
nl: Container maken
pl: Stwórz nowy kontener

# Short name of advanced option
source: arguments
he: ארגומנטים
nl: opdrachtregelopties
pl: argumenty

# Short name of advanced option
source: custom home
he: בית בהתאמה אישית
nl: andere persoonlijke map
pl: niestandardowy katalog domowy

source: %1 volume
he: כרך אחד
pl: %1 wolumen

source: Choose .ini file
he: בחירת קובץ ‎.ini
nl: Kies een .ini-bestand
pl: Wybierz plik .ini

source: INI files (*.ini)
he: קובצי INI‏ (‎*.ini)
nl: Ini-bestanden (*.ini)
pl: Pliki INI (*.ini)

source: Select custom home directory
he: בחירת תיקיית בית כברירת מחדל
nl: Kies een andere persoonlijke map
pl: Wybierz niestandardowy katalog domowy

source: Select volume directory
he: בחירת תיקיית כרכים
nl: Kies een volumemap
pl: Wybierz katalog wolumenu

source: Creating…
he: נוצרת…
nl: Bezig met maken…
pl: Tworzenie...

source: Create
he: יצירה
nl: Maken
pl: Stwórz

source: Assemble
he: הרכבה
nl: Assembleren
pl: Zbuduj

source: Cancel
he: ביטול
nl: Annuleren
pl: Anuluj

source: Use custom image: %1
he: להשתמש בדמות בהתאמה אישית: %1
nl: Andere schijfkopie gebruiken: %1
pl: Użyj niestandardowego obrazu: %1

source: Name and Image fields are required
de: Die Felder für Name und Image sind erforderlich
he: שדות השם והתמונה הם בגדר חובה
nl: Vul de naam- en schijfkopievelden in
pl: Pola nazwa i obraz są wymagane

source: Failed to create container. Please check your input and try again.
de: Das Erstellen des Containers ist fehlgeschlagen. Bitte überprüfen Sie Ihre Eingabe und versuchen Sie es erneut.
he: יצירת המכולה נכשלה. נא לבדוק את הקלט שלך ולנסות שוב.
nl: De container kan niet worden gemaakt. Controleer de invoervelden en probeer het opnieuw.
pl: Tworzenie kontenera nie powiodło się. Proszę sprawdzić wprowadzone dane i spróbować ponownie.

source: Creating container…
de: Container wird erstellt …
he: נוצרת מכולה…
nl: Bezig met aanmaken van container…
pl: Tworzenie kontenera...

source: This may take a few minutes
he: עלול לארוך מספר דקות
nl: Dit kan enkele minuten duren
pl: Może to zająć trochę czasu

source: Fedora
he: פדורה

source: Image
he: דמות
nl: Schijkopie
pl: Obraz

source: Select container image…
he: בחירת דמות מכולה…
nl: Kies een container-schijfkopie…
pl: Wybierz obraz kontenera...

source: Custom image: %1
he: דמות בהתאמה אישית: %1
nl: Andere schijfkopie: %1
pl: Niestandardowy obraz: %1

source: Additional Options
he: אפשרויות נוספות
nl: Aanvullende opties
pl: Dodatkowe opcje

source: Enable systemd init support
he: הפעלת תמיכה באתחול systemd
nl: Ondersteuning voor systemd-init inschakelen
pl: Włącz wsparcie systemd init

source: Enable NVIDIA GPU support
he: הפעלת תמיכה במעבד גרפי של NVIDIA
nl: Ondersteuning voor Nvidia-videokaarten inschakelen
pl: Włącz wsparcie kart graficznych od NVIDIA

source: Hide advanced options
he: הסתרת אפשרויות מתקדמות
nl: Geavanceerde opties verbergen
pl: Ukryj zaawansowane opcje

source: Show advanced options
he: הצגת אפשרויות מתקדמות
nl: Geavanceerde opties tonen
pl: Pokaż zaawansowane opcje

source: Some advanced options are set
he: חלק מהאפשרויות המתקדמות הוגדרו
nl: Er zijn geavanceerde opties ingesteld
pl: Jakieś zaawansowane opcje są skonfigurowane

source: Using advanced options: %1
he: נעשה שימוש בהגדרות מתקדמות: %1
nl: Gebruikmaken van geavanceerde opties: %1
pl: Używając zaawansowanych opcji: %1

source: No advanced options set
he: לא מוגדרות אפשרויות מתקדמות
nl: Er zijn geen geavanceerde opties ingesteld
pl: Nie ustawiono żadnych zaawansowanych opcji

source: Arguments
de: Parameter
he: ארגומנטים
nl: Opdrachtregelopties
pl: Argumenty

source: Additional arguments (optional)
he: ארגומנטים נוספים (רשות)
nl: Aanvullende opties (optioneel)
pl: Dodatkowe argumenty (opcjonalne)

source: Custom Home
he: בית בהתאמה אישית
nl: Andere persoonlijke map
pl: Niestandardowy katalog domowy

source: Use custom home directory
he: להשתמש בתיקיית בית בהתאמה אישית
nl: Andere persoonlijke map gebruiken
pl: Użyj niestandardowego katalogu domowego

source: Clear custom home directory
he: פינוי תיקיית הבית בהתאמה אישית
nl: Andere persoonlijke map wissen
pl: Wyczyść niestandardowy katalog domowy

source: By default, the container will use your home directory
he: כברירת מחדל, המכולה תשתמש בתיקיית הבית שלך
nl: Standaard word de gebruikelijke persoonlijke map gebruikt
pl: Domyślnie kontener będzie używał twojego katalogu domowego

source: Additional Volumes
he: כרכים נוספים
nl: Aanvullende volumes
pl: Dodatkowe wolumeny

source: Remove volume
he: הסרת כרך
nl: Volume verwijderen
pl: Usuń wolumen

source: Add Volume
he: הוספת כרך
nl: Volume toevoegen
pl: Dodaj wolumen

source: Mount additional directories inside the container
he: לעגן תיקיות נוספות בתוך המכולה
nl: Aanvullende mappen aankoppelen in container
pl: Zamontuj dodatkowe katalogi w kontenerze

source: Use Assemble to pick a distrobox.ini manifest. Kontainer will run "distrobox assemble create --file <manifest>" to build every container listed there.
he: אפשר להשתמש בהרכבה כדי לבחור מניפסט/מצהר distrobox.ini.‏ Kontainer יריץ את הפקודה „distrobox assemble create --file <manifest>‎” כדי לבנות את כל אחת מהמכולות שמופיעה כאן.
nl: Maak gebruik van Assemble om een distrobox.ini-manifestbestand te kiezen. Kontainer zal de opdracht ‘distrobox assemble create --file <manifest>’ uitvoeren.
pl: Użyj opcji Zbuduj, aby wybrać plik konfiguracji distrobox.ini. Kontainer uruchomi"distrobox assemble create --file <manifest>", aby zbudować każdy kontener tam umieszczony.

source: Command preview
de: Befehlsvorschau
he: תצוגה מקדימה של פקודה
nl: Voorvertoning
pl: Podgląd komendy

source: Search images…
he: חיפוש דמויות…
nl: Schijfkopieën doorzoeken…
pl: Wyszukuj obrazów...

source: Type to search for images
he: נא להקליד כדי לחפש דמויות
nl: Typ om te zoeken
pl: Pisz, aby wyszukiwać obrazy

source: Remove container
de: Container entfernen
he: הסרת מכולה
nl: Container verwijderen
pl: Usuń kontener

source: Failed to remove container
de: Das Entfernen des Containers ist fehlgeschlagen
he: הסרת המכולה נכשלה
nl: De container kan niet worden verwijderd
pl: Usuwanie kontenera nie powiodło się

source: Are you sure you want to remove %1?
de: Sind Sie sicher, dass Sie %1 entfernen möchten?
he: להסיר את %1?
nl: Weet je zeker dat je “%1” wilt verwijderen?
pl: Czy na pewno chcesz usunąć kontener %1?

source: This action cannot be undone.
de: Diese Aktion kann nicht rückgängig gemacht werden.
he: זאת פעולה בלתי הפיכה.
nl: Deze actie is onomkeerbaar.
pl: To działanie jest nie odwracalne.

source: Create Distrobox Shortcuts
de: Distrobox-Verknüpfungen erstellen
he: יצירת קיצורי דרך ל־Distrobox
nl: Distrobox-snelkoppelingen maken
pl: Stwórz skróty Distrobox

source: Create shortcuts for all containers
de: Verknüpfungen für alle Container erstellen
he: יצירת קיצורי דרך לכל המכולות
nl: Maak snelkoppelingen voor alle containers
pl: Stwórz skróty dla wszystkich kontenerów

source: Alternatively, select a specific container:
de: Alternativ können Sie einen bestimmten Container auswählen:
he: לחלופין, אפשר לבחור מכולה מסוימת:
nl: Of kies een specifieke container:
pl: Alternatywnie, wybierz kontener:

source: Error
de: Fehler
he: שגיאה
nl: Foutmelding
pl: Błąd

source: Failed to create container. Please check your input and try again.
de: Das Erstellen des Containers ist fehlgeschlagen. Bitte überprüfen Sie Ihre Eingabe und versuchen Sie es erneut.
he: יצירת מכולה נכשלה. נא לבדוק את הקלט שלך ולנסות שוב.
nl: De container kan niet worden gemaakt. Controleer de invoervelden en probeer het opnieuw.
pl: Tworzenie kontenera nie powiodło się. Proszę sprawdzić wprowadzone dane i spróbować ponownie.

source: Choose Package
de: Paket auswählen
he: בחירת חבילה
nl: Kies een pakket
pl: Wybierz pakiet

source: Package files
de: Paketdatei auswählen
he: קובצי חבילות
nl: Pakketbestanden
pl: Pliki pakietów

source: Cannot automatically install packages for this distribution. Please enter the distrobox manually and install it using the appropriate package manager.
de: Es können keine Pakete für diese Distribution automatisch installiert werden. Bitte starten Sie die Distrobox manuell ein und installieren Sie sie mit dem entsprechenden Paketmanager.

source: --home=/path/to/home (optional)
de: --home=/pfad/zu/home (optional)
